import type {SelectOption} from "../ui";

export const GENRES_OPTIONS: SelectOption[] =  [
    {
        "id": 1,
        "label": "триллер"
    },
    {
        "id": 2,
        "label": "драма"
    },
    {
        "id": 3,
        "label": "криминал"
    },
    {
        "id": 4,
        "label": "мелодрама"
    },
    {
        "id": 5,
        "label": "детектив"
    },
    {
        "id": 6,
        "label": "фантастика"
    },
    {
        "id": 7,
        "label": "приключения"
    },
    {
        "id": 8,
        "label": "биография"
    },
    {
        "id": 9,
        "label": "фильм-нуар"
    },
    {
        "id": 10,
        "label": "вестерн"
    },
    {
        "id": 11,
        "label": "боевик"
    },
    {
        "id": 12,
        "label": "фэнтези"
    },
    {
        "id": 13,
        "label": "комедия"
    },
    {
        "id": 14,
        "label": "военный"
    },
    {
        "id": 15,
        "label": "история"
    },
    {
        "id": 16,
        "label": "музыка"
    },
    {
        "id": 17,
        "label": "ужасы"
    },
    {
        "id": 18,
        "label": "мультфильм"
    },
    {
        "id": 19,
        "label": "семейный"
    },
    {
        "id": 20,
        "label": "мюзикл"
    },
    {
        "id": 21,
        "label": "спорт"
    },
    {
        "id": 22,
        "label": "документальный"
    },
    {
        "id": 23,
        "label": "короткометражка"
    },
    {
        "id": 24,
        "label": "аниме"
    },
    {
        "id": 25,
        "label": ""
    },
    {
        "id": 26,
        "label": "новости"
    },
    {
        "id": 27,
        "label": "концерт"
    },
    {
        "id": 28,
        "label": "для взрослых"
    },
    {
        "id": 29,
        "label": "церемония"
    },
    {
        "id": 30,
        "label": "реальное ТВ"
    },
    {
        "id": 31,
        "label": "игра"
    },
    {
        "id": 32,
        "label": "ток-шоу"
    },
    {
        "id": 33,
        "label": "детский"
    }
];

